{
    "<PAD>": 0,
    "<UNK>": 1,
    "include": 2,
    "<": 3,
    "stdio": 4,
    ".": 5,
    "h": 6,
    ">": 7,
    "string": 8,
    "void": 9,
    "clear_memory": 10,
    "(": 11,
    "char": 12,
    "*": 13,
    "buffer": 14,
    ",": 15,
    "size_t": 16,
    "length": 17,
    ")": 18,
    "{": 19,
    "volatile": 20,
    "volatile_buffer": 21,
    "=": 22,
    ";": 23,
    "for": 24,
    "i": 25,
    "0": 26,
    "+": 27,
    "[": 28,
    "]": 29,
    "}": 30,
    "int": 31,
    "main": 32,
    "sensitive_data": 33,
    "100": 34,
    "strcpy": 35,
    "This": 36,
    "is": 37,
    "some": 38,
    "sensitive": 39,
    "data": 40,
    "printf": 41,
    "Sensitive": 42,
    "%": 43,
    "s": 44,
    "n": 45,
    "sizeof": 46,
    "/": 47,
    "Code": 48,
    "does": 49,
    "not": 50,
    "use": 51,
    "anymore": 52,
    "return": 53,
    "vulnerableFunction": 54,
    "input": 55,
    "10": 56,
    "Buffer": 57,
    "content": 58,
    "userInput": 59,
    "15": 60,
    "Hello": 61,
    "World": 62,
    "!": 63,
    "copy_data": 64,
    "const": 65,
    "contains": 66,
    "input_data": 67,
    "Enter": 68,
    "fgets": 69,
    "stdin": 70,
    "processInput": 71,
    "Processed": 72,
    "text": 73,
    "stdlib": 74,
    "malloc": 75,
    "if": 76,
    "NULL": 77,
    "1": 78,
    "way": 79,
    "too": 80,
    "long": 81,
    "free": 82,
    "vulnerable_function": 83,
    "64": 84,
    "argc": 85,
    "argv": 86,
    "else": 87,
    "Please": 88,
    "provide": 89,
    "an": 90,
    "writeToBuffer": 91,
    "ptr": 92,
    "-": 93,
    "HelloWorld": 94,
    "readBuffer": 95,
    "arr": 96,
    "size": 97,
    "d": 98,
    "5": 99,
    "2": 100,
    "3": 101,
    "4": 102,
    "printLine": 103,
    "str": 104,
    "putchar": 105,
    "inputString": 106,
    "buffer_underread": 107,
    "ABCDEFGHIJ": 108,
    "contents": 109,
    "c": 110,
    "limits": 111,
    "unsigned": 112,
    "value": 113,
    "UINT_MAX": 114,
    "Initial": 115,
    "u": 116,
    "Value": 117,
    "after": 118,
    "increment": 119,
    "Wrap": 120,
    "around": 121,
    "error": 122,
    "occurs": 123,
    "here": 124,
    "index": 125,
    "array": 126,
    "scanf": 127,
    "&": 128,
    "Data": 129,
    "at": 130,
    "define": 131,
    "BUFFER_SIZE": 132,
    "256": 133,
    "process_message": 134,
    "msg": 135,
    "len": 136,
    "Error": 137,
    "Length": 138,
    "exceeds": 139,
    "memcpy": 140,
    "message": 141,
    "a": 142,
    "test": 143,
    "It": 144,
    "longer": 145,
    "than": 146,
    "expected": 147,
    "input_len": 148,
    "strlen": 149,
    "Actual": 150,
    "specified_len": 151,
    "60": 152,
    "Incorrectly": 153,
    "specified": 154,
    "Incorrect": 155,
    "calculation": 156,
    "allocate": 157,
    "space": 158,
    "null": 159,
    "terminator": 160,
    "fprintf": 161,
    "stderr": 162,
    "Memory": 163,
    "allocation": 164,
    "failed": 165,
    "exit": 166,
    "Potential": 167,
    "overflow": 168,
    "strtok": 169,
    "Remove": 170,
    "newline": 171,
    "character": 172,
    "print_input": 173,
    "user_input": 174,
    "wchar": 175,
    "multi_byte_str": 176,
    "in": 177,
    "Japanese": 178,
    "wchar_t": 179,
    "wide_char_str": 180,
    "L": 181,
    "len_incorrect": 182,
    "Calculation": 183,
    "source": 184,
    "destination": 185,
    "strncpy": 186,
    "Destination": 187,
    "struct": 188,
    "PacketV1": 189,
    "header": 190,
    "8": 191,
    "PacketV2": 192,
    "padding": 193,
    "processPacket": 194,
    "packet": 195,
    "version": 196,
    "pktV1": 197,
    "Processing": 198,
    "V1": 199,
    "pktV2": 200,
    "V2": 201,
    "20": 202,
    "x01": 203,
    "x00": 204,
    "x00HelloV1": 205,
    "12": 206,
    "x02": 207,
    "x00HelloV2": 208,
    "16": 209,
    "INT_MIN": 210,
    "b": 211,
    "result": 212,
    "Result": 213,
    "largeNumber": 214,
    "3000000000": 215,
    "coercedNumber": 216,
    "Original": 217,
    "number": 218,
    "Coerced": 219,
    "signed": 220,
    "processNumber": 221,
    "short": 222,
    "num": 223,
    "extendedNum": 224,
    "hd": 225,
    "getValue": 226,
    "signedValue": 227,
    "process_buffer": 228,
    "signed_index": 229,
    "X": 230,
    "memset": 231,
    "A": 232,
    "large_index": 233,
    "largeValue": 234,
    "300": 235,
    "truncatedValue": 236,
    "Truncated": 237,
    "50": 238,
    "gets": 239,
    "Input": 240,
    "unistd": 241,
    "chroot": 242,
    "var": 243,
    "jail": 244,
    "perror": 245,
    "EXIT_FAILURE": 246,
    "inside": 247,
    "the": 248,
    "system": 249,
    "bin": 250,
    "sh": 251,
    "VerySecretPassword123": 252,
    "realloc": 253,
    "200": 254,
    "Continue": 255,
    "using": 256,
    "but": 257,
    "old": 258,
    "may": 259,
    "remain": 260,
    "memory": 261,
    "pthread": 262,
    "shared_resource": 263,
    "increment_resource": 264,
    "arg": 265,
    "temp": 266,
    "pthread_t": 267,
    "thread1": 268,
    "thread2": 269,
    "pthread_create": 270,
    "pthread_join": 271,
    "Shared": 272,
    "Resource": 273,
    "signal": 274,
    "shared_var": 275,
    "handler": 276,
    "sig": 277,
    "race": 278,
    "condition": 279,
    "with": 280,
    "128": 281,
    "Non": 282,
    "reentrant": 283,
    "functions": 284,
    "Modify": 285,
    "shared": 286,
    "state": 287,
    "SIGINT": 288,
    "SIGTERM": 289,
    "while": 290,
    "sleep": 291,
    "Simulate": 292,
    "work": 293,
    "thread_function": 294,
    "local_copy": 295,
    "usleep": 296,
    "Final": 297,
    "of": 298,
    "untrustedFunction": 299,
    "Modified": 300,
    "by": 301,
    "untrusted": 302,
    "function": 303,
    "mutableData": 304,
    "Before": 305,
    "After": 306,
    "getSecretData": 307,
    "static": 308,
    "secretData": 309,
    "Information": 310,
    "modification": 311,
    "Tampered": 312,
    "handle_data": 313,
    "Example": 314,
    "newData": 315,
    "printValue": 316,
    "x": 317,
    "setjmp": 318,
    "jmp_buf": 319,
    "env": 320,
    "cleanup_resources": 321,
    "FILE": 322,
    "file": 323,
    "fclose": 324,
    "process_file": 325,
    "filename": 326,
    "1024": 327,
    "fopen": 328,
    "r": 329,
    "|": 330,
    "longjmp": 331,
    "perform": 332,
    "operations": 333,
    "that": 334,
    "might": 335,
    "throw": 336,
    "Exception": 337,
    "caught": 338,
    "resources": 339,
    "cleaned": 340,
    "properly": 341,
    "example": 342,
    "txt": 343,
    "typedef": 344,
    "key": 345,
    "AssocList": 346,
    "alist": 347,
    "key1": 348,
    "key2": 349,
    "30": 350,
    "search_key": 351,
    "strcmp": 352,
    "Found": 353,
    "Node": 354,
    "next": 355,
    "createListWithSentinel": 356,
    "sentinel": 357,
    "appendNode": 358,
    "newNode": 359,
    "printList": 360,
    "current": 361,
    "deleteNode": 362,
    "break": 363,
    "unsafeDeleteSentinel": 364,
    "processString": 365,
    "11": 366,
    "user": 367,
    "inputs": 368,
    "including": 369,
    "byte": 370,
    "max": 371,
    "characters": 372,
    "strcspn": 373,
    "get_string": 374,
    "strings": 375,
    "Returns": 376,
    "pointer": 377,
    "outside": 378,
    "range": 379,
    "Index": 380,
    "out": 381,
    "Failed": 382,
    "to": 383,
    "zu": 384,
    "incorrectValue": 385,
    "firstChunk": 386,
    "secondChunk": 387,
    "ptrdiff_t": 388,
    "incorrectSize": 389,
    "td": 390,
    "dest": 391,
    "printMessage": 392,
    "switch": 393,
    "case": 394,
    "Option": 395,
    "selected": 396,
    "Missing": 397,
    "default": 398,
    "syslog": 399,
    "signal_handler": 400,
    "LOG_INFO": 401,
    "Signal": 402,
    "received": 403,
    "openlog": 404,
    "CWE": 405,
    "479": 406,
    "LOG_PID": 407,
    "LOG_CONS": 408,
    "LOG_USER": 409,
    "pause": 410,
    "closelog": 411,
    "validUser": 412,
    "means": 413,
    "false": 414,
    "true": 415,
    "operator": 416,
    "used": 417,
    "intended": 418,
    "instead": 419,
    "Access": 420,
    "granted": 421,
    "denied": 422,
    "y": 423,
    "will": 424,
    "always": 425,
    "print": 426,
    "because": 427,
    "assignment": 428,
    "never": 429,
    "equal": 430,
    "checkValue": 431,
    "The": 432,
    "positive": 433,
    "should": 434,
    "only": 435,
    "appear": 436,
    "checkLevel": 437,
    "level": 438,
    "Level": 439,
    "Basic": 440,
    "access": 441,
    "Intermediate": 442,
    "Full": 443,
    "Invalid": 444,
    "id": 445,
    "name": 446,
    "PrivateData": 447,
    "privateData": 448,
    "42": 449,
    "SensitiveName": 450,
    "getPrivateData": 451,
    "ID": 452,
    "Name": 453,
    "ModifiedName": 454,
    "privateArray": 455,
    "DataHolder": 456,
    "holder": 457,
    "setData": 458,
    "publicData": 459,
    "publicInput": 460,
    "ThisIsPublicData": 461,
    "private": 462,
    "print_username": 463,
    "getlogin": 464,
    "User": 465,
    "get": 466,
    "login": 467,
    "sys": 468,
    "types": 469,
    "stat": 470,
    "mode_t": 471,
    "old_mask": 472,
    "new_mask": 473,
    "0644": 474,
    "umask": 475,
    "Old": 476,
    "New": 477,
    "set": 478,
    "getLocalValue": 479,
    "localVar": 480,
    "Attempt": 481,
    "dereference": 482,
    "invalid": 483,
    "your": 484,
    "Potentially": 485,
    "dangerous": 486,
    "Extra": 487,
    "Argument": 488,
    "correctValue": 489,
    "float": 490,
    "wrongValue": 491,
    "14": 492,
    "fcntl": 493,
    "errno": 494,
    "copy_file": 495,
    "source_path": 496,
    "dest_path": 497,
    "source_fd": 498,
    "dest_fd": 499,
    "ssize_t": 500,
    "bytes_read": 501,
    "bytes_written": 502,
    "open": 503,
    "O_RDONLY": 504,
    "O_WRONLY": 505,
    "O_CREAT": 506,
    "O_TRUNC": 507,
    "0666": 508,
    "close": 509,
    "read": 510,
    "write": 511,
    "1234567890123456789": 512,
    "convertedValue": 513,
    "ld": 514,
    "Converted": 515,
    "stdbool": 516,
    "bool": 517,
    "perform_security_check": 518,
    "allow_access": 519,
    "security": 520,
    "check": 521,
    "fails": 522,
    "delete": 523,
    "windows": 524,
    "winioctl": 525,
    "IOCTL_VULN_METHOD_NEITHER": 526,
    "CTL_CODE": 527,
    "FILE_DEVICE_UNKNOWN": 528,
    "METHOD_NEITHER": 529,
    "FILE_ANY_ACCESS": 530,
    "DWORD": 531,
    "WINAPI": 532,
    "VulnerableIoctlHandler": 533,
    "LPVOID": 534,
    "lpParam": 535,
    "PVOID": 536,
    "ioBuffer": 537,
    "PIRP": 538,
    "irp": 539,
    "PIO_STACK_LOCATION": 540,
    "irpSp": 541,
    "ULONG": 542,
    "inputBufferLength": 543,
    "outputBufferLength": 544,
    "IoGetCurrentIrpStackLocation": 545,
    "UserBuffer": 546,
    "Parameters": 547,
    "DeviceIoControl": 548,
    "InputBufferLength": 549,
    "OutputBufferLength": 550,
    "IoControlCode": 551,
    "Vulnerability": 552,
    "No": 553,
    "validation": 554,
    "on": 555,
    "provided": 556,
    "address": 557,
    "RtlCopyMemory": 558,
    "Vulnerable": 559,
    "min": 560,
    "IoStatus": 561,
    "Status": 562,
    "STATUS_SUCCESS": 563,
    "STATUS_INVALID_DEVICE_REQUEST": 564,
    "IoCompleteRequest": 565,
    "IO_NO_INCREMENT": 566,
    "IOCTL_RESTRICTED_FUNCTION": 567,
    "METHOD_BUFFERED": 568,
    "RestrictedFunction": 569,
    "Restricted": 570,
    "functionality": 571,
    "accessed": 572,
    "DeviceIoControlHandler": 573,
    "lpParameter": 574,
    "bytesReturned": 575,
    "HANDLE": 576,
    "hDevice": 577,
    "CreateFile": 578,
    "ExampleDevice": 579,
    "GENERIC_READ": 580,
    "GENERIC_WRITE": 581,
    "OPEN_EXISTING": 582,
    "INVALID_HANDLE_VALUE": 583,
    "CloseHandle": 584,
    "hThread": 585,
    "CreateThread": 586,
    "WaitForSingleObject": 587,
    "INFINITE": 588,
    "authenticate_user": 589,
    "username": 590,
    "password": 591,
    "correct_user": 592,
    "admin": 593,
    "correct_pass": 594,
    "secret": 595,
    "backdoor": 596,
    "wrongpass": 597,
    "path": 598,
    "realpath": 599,
    "that_could_exceed": 600,
    "sixty_four_characters": 601,
    "or_more": 602,
    "Normalized": 603,
    "Usage": 604,
    "atoi": 605,
    "allocated": 606,
    "src": 607,
    "very": 608,
    "copyBuffer": 609,
    "12345678901234": 610,
    "processItems": 611,
    "numItems": 612,
    "items": 613,
    "Cannot": 614,
    "process": 615,
    "more": 616,
    "integerPtr": 617,
    "double": 618,
    "doubleValue": 619,
    "14159": 620,
    "Integer": 621,
    "interpretation": 622,
    "fd": 623,
    "O_RDWR": 624,
    "S_IRUSR": 625,
    "S_IWUSR": 626,
    "bytesRead": 627,
    "Content": 628,
    "ref_count": 629,
    "create_resource": 630,
    "res": 631,
    "retain_resource": 632,
    "release_resource": 633,
    "res1": 634,
    "numObjects": 635,
    "objects": 636,
    "object": 637,
    "successfully": 638,
    "shift": 639,
    "Negative": 640,
    "left": 641,
    "32": 642,
    "Over": 643,
    "bit": 644,
    "integer": 645,
    "over": 646,
    "w": 647,
    "Multiple": 648,
    "release": 649,
    "same": 650,
    "resource": 651
}